CSI API ETABS v1
cPointObj.GetMass Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetMass(
	string Name,
	ref double[] M
)
Function GetMass (
	Name As String,
	ByRef M As Double()
) As Integer
Dim instance As cPointObj
Dim Name As String
Dim M As Double()
Dim returnValue As Integer
returnValue = instance.GetMass(Name, M)
int GetMass(
	String^ Name,
	array<double>^% M
)
abstract GetMass :
        Name : string *
        M : float[] byref -> int
Parameters
Name
Type: System.String
M
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace